import { sources } from "../sources";
import { make } from "../utils";

export const kyrgyz = make({ language: "kgz" }, {
  544: {
    input: "2.3.0",
    author: sources.lyricstranslate.makeAuthor("M. K."),
    content: `Үч Шакек эльф-кандары үчүн көк астындагы,
Жетөөсү эргежээл-төрөлөрү үчүн таш тамдагы,
Тогузоо ичер суусу ченелген Адам үчүн бир күнү өлүм табары,
Бирөө Кара Төрө үчүн кара тактагы,
Мордордун жеринде, көлөкө жатканы.
Бир шакек башкарыш үчүн баарын аларды, Бир шакек табыш үчүн аларды,
Бир шакек чогултуп барын караңгыда байлаш үчүн аларды
Мордордун жеринде көлөкө жатканы.`
  },
});
