import { make } from "../utils";

export const mongolian = make({ language: "mon" }, {
  520: {
    input: "2.2.0",
    author: [],
    content: `Гурван бөгжийг асар тэнгэрт суугч хаанлаг эльфүүдэд,
Долоон бөгжийг чулуун тэрэмд суугч гномуудын эздэд,

Есөн бөгжийг булшны хумхийн тоос өмсөгч Естүүдэд,

Нэг бөгжийг Мордор нэрт харанхуйн орноо
Хар ширээнээ залрагч Эзэн зүүх болой.

Нэг бөгж Мордор нэрт харанхуйн орноо
Тэднийг захирна, тэднийг хураана,

Нэг бөгж тэднийг хар гинжинд хэлхэж давтана`
  },
});
