import { ME } from "../authors";
import { make } from "../utils";

export const ophenian = make({ language: "oph" }, {
  268: {
    input: "0.11.5",
    author: ME,
    content: `стрем нахирежников - ельфов клевотарям, кчон под ебом,
сизюм - ласовским ховрякам из копуяка у рымах,
девера - трущам темлешным, корьему отемнеть наскербе,
ион - Ховряку Тудошному, корьев седмальник тудошный
у Тудошнице, где меркошь, тудошная меркоть лепшает.
Елой Нахирежник Ионый усеми бунчит ховрячить,
усех Ион нахлит и збиряет, у меркоши забатлает
у Тудошнице, где меркошь, тудошная меркоть лепшает.`
  },
});
