import { book, make } from "../utils";

export const bg = make({ language: "bul" }, {
  87: {
    input: "0.2.0",
    name: "офиц. перевод",
    book: book("B-1", 116),
    author: "Ljubomir Nikolov",
    content: `Три пръстена за елфите-крале под този небосвод
и седем за джуджетата в дворците им от камък,
да вземат девет хората със краткия живот,
един - за Мрачния владетел с трон от черен пламък
в страната му Мордор, където тегне мрак.
Единствен пръстен ги владее, Единствен той ще ги открие,
Единствен вси ще ги сбере и и в тъмнина ще ги обвие
в страната му Мордор, където тегне мрак.`
  },
});
