import { make } from "../utils";
import pic525 from "../pic/525mar.jpg";

export const mar = make({ language: "mar" }, {
  525: {
    input: "2.2.0",
    author: [],
    content: [{
      type: "image",
      image: pic525,
    }]
    /*
    text: `नभाखालच्या एल्फनृपांच्या तीन मुद्रिका
पाषाणाच्या भव्य दालनी ड्बार्फनृपांच्या सात मुद्रिका
मृत्यूभयाकुल मर्त्य मानबांसाठी घडल्या नऊ मुद्रिका
आणि एकच - केवळ एकच
कृष्णशक्तीच्या स्वामीकरिता
जो असेल आरूढ अघोर काळ्या सिंहासनावर
तमसांकित काळ्या... मोर‌्डॉरच्या मरणभूमीवर...
ही एक मुद्रिका अंकुश जैसा सर्वांवरचा
ही एक मुद्रिका घेईल शोध सर्वांचा
ही एक मुद्रिका घेईल वेध सर्वांचा
ही एकच घालील सकलांना, विळखा तमपाशांचा..
तमसांकित काळ्या... मोर‌्डॉरच्या मरणभूमीवर...`
     */
  },
});
