import { fromLotR, make } from "../utils";
import pic415 from "../pic/415per.jpg";

export const persian = make({ language: "per" }, {
  415: {
    input: "0.16.3",
    author: "Reza Alizadeh",
    name: fromLotR(),
    book: ["P", 156],
    content: [
      {
        type: "rtl",
        text: `حلقه ای سه برای پادشاهان الف در زیر گنبد نیلی
حلقه ای هفت برای فرمان روایان دورف در تالارهای سنگی
حلقه ای نه برای آدمیان که محکوم به مرگ اند و فانی
و یکی از برای فرمانروای تاریکی
بر سریر تاریکش
در سرزمین موردور و سایه های آرامیده اش
حلقه ای است از برای حکم راندن، حلقه ای است برای یافتن،
حلقه ای است از برای آوردن، و در تاریکی به هم پیوستن،
در سرزمین موردور و سایه های آرامیده اش`
      },
      {
        name: "pic",
        type: "image",
        image: pic415,
      }
    ]
  },
});
