import { book, make } from "../utils";

export const ukr = make({ language: "ukr" }, {
  113: {
    input: "0.4.0",
    name: "офиц. версия",
    author: "Oleksandr Mokrovolskii",
    book: book("U-1", 120),
    content: `Три Перснi - ельфам чарiвна тюрьма,
Сiм Перснiв - гномам-ковалям темниця,
А дев'ять - людям смерть сама;
Один - лиш Князю Чорному кориться
В краiнi Мордор, де панує тьма.
Один - щоб мати всiх, всiх розшукати,
Усiх приволокти i всiх зв'язати
В краiнi Мордор, де панує тьма.`
  },
});
