import { book, make } from "../utils";

export const ukr = make({ language: "ukr" }, {
  113: {
    input: "0.4.0",
    name: "офиц. версия",
    author: "Oleksandr Mokrovolskii",
    book: book("U-1", 120),
    content: `Три Перснi - ельфам чарiвна тюрьма,
Сiм Перснiв - гномам-ковалям темниця,
А дев'ять - людям смерть сама;
Один - лиш Князю Чорному кориться
В краiнi Мордор, де панує тьма.
Один - щоб мати всiх, всiх розшукати,
Усiх приволокти i всiх зв'язати
В краiнi Мордор, де панує тьма.`
  },
  116: {
    input: "0.4.3",
    author: "ardann [АнК]",
    book: book("U-5", 124),
    content: `Три персня - ельфам у пiдзоряний свiт,
Сiм - для дварфiв, господарів гiр,
Дев'ять - людям, смертним повiк,
А Один - для Володаря на чорному тронi
В країнi Мордор, де темряви край:
Щоб всiх їх знайти, всiх поєднати,
I чорною волею разом зв'язати
В країнi Мордор, де темряви край.`
  },
});
