import { book, make } from "../../utils";

export const gothic = make({ language: "got" }, {
  79: {
    input: "0.2.0",
    author: "David Salo",
    book: book("G-1", 187, "and G-2, p.188"),
    content: [
      {
        text: `Þrija figgragulþa faur þans albiska-þiudanans undar þana himin,
Sibun faur þans dwairga-fraujans in rohsnim seinaim stainahaim,
Niun faur mannans diwanans, domidans diwan,
Ain faur þana fraujan riqizeinan ana stola riqizeinamma seinamma
In þamma landa Maurdauris þarei þai skadjus ligand.
Ain figgragulþ waldan ija alla, ain figgragulþ finþan ija,
Ain figgragulþ briggan ija alla jah in riqiza bindan ija
In þamma landa Maurdauris þarei þai skadjus ligand.`
      },
      {
        text: `𐌸𐍂𐌹𐌾𐌰 𐍆𐌹𐌲𐌲𐍂𐌰𐌲𐌿𐌻𐌸𐌰 𐍆𐌰𐌿𐍂 𐌸𐌰𐌽𐍃 𐌰𐌻𐌱𐌹𐍃𐌺𐌰-𐌸𐌹𐌿𐌳𐌰𐌽𐌰𐌽𐍃 𐌿𐌽𐌳𐌰𐍂 𐌸𐌰𐌽𐌰 𐌷𐌹𐌼𐌹𐌽,
𐍃𐌹𐌱𐌿𐌽 𐍆𐌰𐌿𐍂 𐌸𐌰𐌽𐍃 𐌳𐍅𐌰𐌹𐍂𐌲𐌰-𐍆𐍂𐌰𐌿𐌾𐌰𐌽𐍃 𐌹𐌽 𐍂𐍉𐌷𐍃𐌽𐌹𐌼 𐍃𐌴𐌹𐌽𐌰𐌹𐌼 𐍃𐍄𐌰𐌹𐌽𐌰𐌷𐌰𐌹𐌼,
𐌽𐌹𐌿𐌽 𐍆𐌰𐌿𐍂 𐌼𐌰𐌽𐌽𐌰𐌽𐍃 𐌳𐌹𐍅𐌰𐌽𐌰𐌽𐍃, 𐌳𐍉𐌼𐌹𐌳𐌰𐌽𐍃 𐌳𐌹𐍅𐌰𐌽,
𐌰𐌹𐌽 𐍆𐌰𐌿𐍂 𐌸𐌰𐌽𐌰 𐍆𐍂𐌰𐌿𐌾𐌰𐌽 𐍂𐌹𐌵𐌹𐌶𐌴𐌹𐌽𐌰𐌽 𐌰𐌽𐌰 𐍃𐍄𐍉𐌻𐌰 𐍂𐌹𐌵𐌹𐌶𐌴𐌹𐌽𐌰𐌼𐌼𐌰 𐍃𐌴𐌹𐌽𐌰𐌼𐌼𐌰,
𐌹𐌽 𐌸𐌰𐌼𐌼𐌰 𐌻𐌰𐌽𐌳𐌰 𐌼𐌰𐌿𐍂𐌳𐌰𐌿𐍂𐌹𐍃 𐌸𐌰𐍂𐌴𐌹 𐌸𐌰𐌹 𐍃𐌺𐌰𐌳𐌾𐌿𐍃 𐌻𐌹𐌲𐌰𐌽𐌳.
𐌰𐌹𐌽 𐍆𐌹𐌲𐌲𐍂𐌰𐌲𐌿𐌻𐌸 𐍅𐌰𐌻𐌳𐌰𐌽 𐌹𐌾𐌰 𐌰𐌻𐌻𐌰, 𐌰𐌹𐌽 𐍆𐌹𐌲𐌲𐍂𐌰𐌲𐌿𐌻𐌸 𐍆𐌹𐌽𐌸𐌰𐌽 𐌹𐌾𐌰,
𐌰𐌹𐌽 𐍆𐌹𐌲𐌲𐍂𐌰𐌲𐌿𐌻𐌸 𐌱𐍂𐌹𐌲𐌲𐌰𐌽 𐌹𐌾𐌰 𐌰𐌻𐌻𐌰 𐌾𐌰𐌷 𐌹𐌽 𐍂𐌹𐌵𐌹𐌶𐌰 𐌱𐌹𐌽𐌳𐌰𐌽 𐌹𐌾𐌰.
𐌹𐌽 𐌸𐌰𐌼𐌼𐌰 𐌻𐌰𐌽𐌳𐌰 𐌼𐌰𐌿𐍂𐌳𐌰𐌿𐍂𐌹𐍃 𐌸𐌰𐍂𐌴𐌹 𐌸𐌰𐌹 𐍃𐌺𐌰𐌳𐌾𐌿𐍃 𐌻𐌹𐌲𐌰𐌽𐌳.`
      }
    ]
  }
});
