import { sources } from "../../sources";
import { fromLotR, make } from "../../utils";

export const bel = make({ language: "bel" }, {
  423: {
    input: "0.17.0",
    source: sources.translations,
    author: ["Д.Магiлеўцав", "К.Курчанкова"],
    name: fromLotR(),
    content: `Тры – сьмяротнай зямлі несьмяротным князям,
Сем – царам-кавалям на падгорным троне,
Дзевяць – чалавечага племені каралям,
Адзін – Уладару Цемры ў чорнай кароне,
У змрочнай краіне Мордар, там, дзе пануе Цень.
Адзін – уладарыць над імі, адзін – адшукаць іх,
Адзін – завабіць і ў цемры чорнай скаваць іх
У змрочнай краіне Мордар, там, дзе пануе Цень.`
  },
});
