import { sources } from "../../sources";
import { fromLotR, make } from "../../utils";

export const bel = make({ language: "bel" }, {
  423: {
    input: "0.17.0",
    source: sources.translations,
    author: ["Д.Магiлеўцав", "К.Курчанкова"],
    name: fromLotR(),
    content: `Тры – сьмяротнай зямлі несьмяротным князям,
Сем – царам-кавалям на падгорным троне,
Дзевяць – чалавечага племені каралям,
Адзін – Уладару Цемры ў чорнай кароне,
У змрочнай краіне Мордар, там, дзе пануе Цень.
Адзін – уладарыць над імі, адзін – адшукаць іх,
Адзін – завабіць і ў цемры чорнай скаваць іх
У змрочнай краіне Мордар, там, дзе пануе Цень.`
  },
  469: {
    input: "1.0.2",
    author: "Romena",
    book: ["B", 118],
    content: `Тры пярсцёнкi для эльфаў-каралёў пад небам высокiм,
Сем - у каменныя залi - гномам - уладарам горным,
Дзевяць - людзям, што павiнны заснуць апошнiм сном глыбокiм,
Адзiн - Цёмнаму князю на яго троне чорным
У краiне Мордар, дзе ценi ляглi.
Адзiн пярсценак iмi ўсемi кiруе,
Адзiн для ўсiх у цемразi ланцуг мацуе
У краiне Мордар, дзе ценi ляглi.`
  },
});
