import { make } from "../../utils";

export const lemk = make({ language: "lem" }, {
  470: {
    input: "1.0.2",
    author: "Tomasz Kwoka",
    book: ["L", 119],
    content: `Три перстенi для ельфiх цисарiв пiд отвореным небом,
сiм для краснолюдовых владарiв в iх замках з камiня,
девят для смертельникiв, смерти преказаных,
єден для Царя Темрявы, на його чорным тронi
В Мордор Краiнi, де владают тiни.
Єден перстiн бы вшыткима рядити, єден перстiн бы вшыткы найти,
єден перстiн бы вшыткы зобрати i в темрявi повязати
В Мордор Краiнi, де владают тiни.`
  },
});
