import { fromLotR, make } from "../../utils";

export const mac = make({ language: "mac" }, {
  468: {
    input: "1.0.2",
    author: [],
    name: fromLotR(),
    book: ["M", 117],
    content: `Три прстена за Кралевите елфите под небото сjаjно
Седум за владетелите на Џуџињата во дворецот камен
Девет за Смртните Луѓе што умираат знаjно и незнаjно
Еден за Мрачинот Господар на престолот негов темен
Во Земjата Мордор Сенките каj чмаат
Еден Прстен да господари со сите, еден каj сите брза,
Еден Прстен сите да ги збере, во мрак да ги врзе
Во Земjата Мордор Сенките каj чмаат`
  },
});
