import { ME } from "../authors";
import { make } from "../utils";

export const data = make({ language: "c.bugn" }, {
  97: {
    input: "0.2.10",
    author: ME,
    comments: ["с дополнениями переводчика"],
    content: `Ба Назг для Ба Див но под ба ня,
Ба Назг для Ба Зад ов в их ха тах,
Ба Назг ов для Тарк ов, дэт бу дут,
Гы Назг для Ам Ба ла Гыр Хыр а
На Ха та, где гыр ча и Глюк и.
Гы Назг гыр хыр их, Гы Назг бы ам их,
Гы Назг бы ня их и в гыр ча шам их
На Ха та, где гыр ча и Глюк и.`
  },
});
