import { ME } from "../authors";
import { make } from "../utils";

export const kh = make({ language: "c.karkhuzdul" }, {
  98: {
    input: "0.2.10",
    author: ME,
    comments: ["с дополнениями переводчика"],
    content: `Тро Дерга зел узбаду Куриру уй шатур,
Да Дерга зел Узбаду Кхазад исс вахрамгунд,
Бор Дерга зел узбаду сек Сигилтан,
Ба Дерга зел Упсуз гюр худер исс нург гатхол
Исс Наргуун ур нараг ракхас ёк упс.
Ба Дерга узбад доху, Ба Дерга анобе кур доху,
Ба Дерга булт доху ёк исс нург бинур доху
Исс Наргуун ур нараг ракхас ёк упс.`
  }
});
